
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <title>commander介绍 · GitBook</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.1.1">
        <meta name="author" content="Imfly">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="shortcut icon" href="../../gitbook/images/logo/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    

    
    <link rel="next" href="../2-客户端开发/readme.html" />
    
    
    <link rel="prev" href="readme.html" />
    

    </head>
    <body>
        
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


            <a href="/" class="logo">
                <img src="../../gitbook/images/logo/128.png">
                <h1></h1>
            </a>

            

            
                
                <a href="../2-客户端开发/readme.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-right"></i>
                </a>
                
                
                <a href="readme.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-left"></i>
                </a>
                
            
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default">
        

        <div class="list-group">
            
    
        
        <a href="../../" class="list-group-item ">
        
            
            Introduction
        
        </a>
        

        
    
        
        <a href="../../0-开篇的话/readme.html" class="list-group-item ">
        
            
            开篇的话
        
        </a>
        

        
    
        
        <a href="../../1-了解加密货币/readme.html" class="list-group-item ">
        
            
            了解加密货币
        
        </a>
        

        
    
        
        <a href="../../2-Node.js入门指南/readme.html" class="list-group-item ">
        
            
            Node.js入门指南
        
        </a>
        

        
    
        
        <a href="../../3-源码解读/readme.html" class="list-group-item ">
        
            
            源码解读
        
        </a>
        

        
    
        
        <a href="../readme.html" class="list-group-item ">
        
            
            开发实践
        
        </a>
        

        
        
    
        
        <a href="../0-后台的架构/readme.html" class="list-group-item ">
        
            
            后台的架构
        
        </a>
        

        
    
        
        <a href="readme.html" class="list-group-item ">
        
            
            命令行设计
        
        </a>
        

        
        
    
        
        <a href="1-commander介绍.html" class="list-group-item active">
        
            
                <i class="octicon octicon-chevron-right"></i>
            
            commander介绍
        
        </a>
        

        
    

        
    
        
        <a href="../2-客户端开发/readme.html" class="list-group-item ">
        
            
            客户端开发
        
        </a>
        

        
    
        
        <a href="../3-加密与解密/readme.html" class="list-group-item ">
        
            
            加密与解密
        
        </a>
        

        
    
        
        <a href="../4-部署与环境/readme.html" class="list-group-item ">
        
            
            部署与环境
        
        </a>
        

        
    
        
        <a href="../5-常见的大坑/readme.html" class="list-group-item ">
        
            
            常见的大坑
        
        </a>
        

        
    

        
    
        
        <a href="../../5-附录/readme.html" class="list-group-item ">
        
            
            附录
        
        </a>
        

        
    
        
        <a href="../../6-后记/readme.html" class="list-group-item ">
        
            
            后记
        
        </a>
        

        
    

        </div>
    </div>
    


                    </div>
                    <div class="col-md-9">
                        
<div id="book-search-results">
    <div class="search-noresults">
    
                            
                            <div class="gb-markdown book-page-inner">
                                <h1 id="commander&#x4ECB;&#x7ECD;">commander&#x4ECB;&#x7ECD;</h1>
<h2 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h2>
<p>&#x4ECE;&#x524D;&#x9762;&#x7684;&#x6E90;&#x7801;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;commander&#x3001;domain&#x548C;async&#x4E09;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF08;&#x6216;&#x6A21;&#x5757;&#xFF09;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5BF9;&#x6574;&#x4E2A;app.js&#x7A0B;&#x5E8F;&#x8D77;&#x5230;&#x4E86;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4F5C;&#x4E3A;&#x6280;&#x672F;&#x79EF;&#x7D2F;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x63A2;&#x7A76;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x5C31;&#x6309;&#x7167;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x8FD9;&#x4E09;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF08;&#x6A21;&#x5757;&#xFF09;&#x7684;&#x4F7F;&#x7528;&#x3002;</p>
<h2 id="&#x9898;&#x5916;&#x8BDD;">&#x9898;&#x5916;&#x8BDD;</h2>
<p>&#x6211;&#x575A;&#x4FE1;&#xFF0C;&#x641E;&#x7F16;&#x7A0B;&#x7684;&#x90FD;&#x662F;&#x5B66;&#x4E60;&#x9AD8;&#x624B;&#xFF0C;&#x667A;&#x5546;&#x5F88;&#x9AD8;&#x3002;&#x4F46;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x65B9;&#x6CD5;&#x8FE5;&#x5F02;&#x3002;&#x6709;&#x7684;&#x5929;&#x751F;&#x806A;&#x9896;&#xFF0C;&#x7FFB;&#x7FFB;&#x6E90;&#x7801;&#x548C;&#x6587;&#x6863;&#xFF0C;&#x5C31;&#x80FD;&#x5728;&#x65E5;&#x540E;&#x81EA;&#x7531;&#x4F7F;&#x7528;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6709;&#x7684;&#x5C31;&#x5DEE;&#x4E00;&#x4E9B;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x5C31;&#x7B97;&#x5178;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x575A;&#x4FE1;&#x81EA;&#x5DF1;&#x611A;&#x949D;&#x81F3;&#x6781;&#x3002;</p>
<p>&#x6211;&#x7ECF;&#x5E38;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF0C;&#x8FD9;&#x6B21;&#x7528;&#x4E86;&#xFF0C;&#x4E0B;&#x6B21;&#x6709;&#x9700;&#x8981;&#xFF0C;&#x8FD8;&#x8981;&#x518D;&#x770B;&#x6587;&#x6863;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x65B9;&#x6CD5;&#x7684;&#x9009;&#x62E9;&#x4E0A;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8981;&#x53CD;&#x590D;&#x8BD5;&#x9A8C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x6211;&#x8BA4;&#x771F;&#x603B;&#x7ED3;&#x548C;&#x6539;&#x8FDB;&#x81EA;&#x5DF1;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x52AA;&#x529B;&#x5411;&#x9AD8;&#x624B;&#x9760;&#x62E2;&#x3002;</p>
<p>&#x8FD9;&#x5173;&#x7CFB;&#x5230;&#x201C;&#x77E5;&#x8BC6;&#x201D;&#x7684;&#x7406;&#x89E3;&#x548C;&#x5438;&#x6536;&#x3002;&#x77E5;&#x8BC6;&#x7531;&#x8BED;&#x8A00;&#x7EC4;&#x6210;&#xFF0C;&#x8BED;&#x8A00;&#x7531;&#x6982;&#x5FF5;&#x548C;&#x903B;&#x8F91;&#x7EC4;&#x6210;&#xFF0C;&#x6982;&#x5FF5;&#x548C;&#x903B;&#x8F91;&#x6D89;&#x53CA;&#x5230;&#x4EBA;&#x7684;&#x8BB0;&#x5FC6;&#x80FD;&#x529B;&#x4E0E;&#x5206;&#x6790;&#x80FD;&#x529B;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x559C;&#x6B22;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x6982;&#x5FF5;&#x201C;&#x89C6;&#x800C;&#x4E0D;&#x89C1;&#x201D;&#x3002;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x89C1;&#x5230;&#x6709;&#x4EBA;&#x63CF;&#x8FF0;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7528;&#x201C;&#x8FD9;&#x4E2A;&#x3001;&#x90A3;&#x4E2A;&#x201D;&#x7B49;&#x4EE3;&#x8BCD;&#x6216;&#x5F62;&#x5BB9;&#x8BCD;&#x4EE3;&#x66FF;&#x4E8B;&#x4EF6;&#x4E2D;&#x7684;&#x4EBA;&#x7269;&#xFF0C;&#x5E94;&#x5C5E;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6982;&#x5FF5;&#x4E2D;&#x542B;&#x6709;&#x903B;&#x8F91;&#xFF0C;&#x662F;&#x903B;&#x8F91;&#x7684;&#x9AD8;&#x7EA7;&#x6D53;&#x7F29;&#x7248;&#x3002;&#x6982;&#x5FF5;&#x6E05;&#x6670;&#xFF0C;&#x903B;&#x8F91;&#x5FC5;&#x7136;&#x662F;&#x6E05;&#x6670;&#x7684;&#xFF0C;&#x76F8;&#x53CD;&#x5374;&#x672A;&#x5FC5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B66;&#x4E60;&#x77E5;&#x8BC6;&#xFF0C;&#x638C;&#x63E1;&#x6982;&#x5FF5;&#x6700;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x6A21;&#x5757;&#xFF0C;&#x4EC0;&#x4E48;&#x53EB;&#x7EC4;&#x4EF6;&#xFF1F;&#x6211;&#x7684;&#x7406;&#x89E3;&#x662F;&#xFF0C;Node.js&#x63D0;&#x4F9B;&#x7684;&#x539F;&#x751F;&#x529F;&#x80FD;&#x6A21;&#x5757;&#xFF0C;&#x53EB;<code>&#x6A21;&#x5757;</code>&#xFF08;<code>module</code>&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;domain)&#xFF0C;&#x800C;&#x7B2C;&#x4E09;&#x65B9;&#x63D0;&#x4F9B;&#x7684;&#x72EC;&#x7ACB;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x79F0;&#x4E3A;<code>&#x7EC4;&#x4EF6;</code>(<code>component</code>)&#xFF0C;&#x5176;&#x5B9E;&#x4ED6;&#x4EEC;&#x90FD;&#x53EB;<code>&#x4E2D;&#x95F4;&#x4EF6;</code>&#xFF08;<code>middleware</code>)&#xFF0C;&#x672C;&#x8D28;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#x903B;&#x8F91;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;&#x533A;&#x5206;&#x4E00;&#x4E0B;&#xFF0C;&#x5176;&#x5B9E;&#x8868;&#x660E;&#x6211;&#x4EEC;&#x638C;&#x63E1;&#x4E86;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x6587;&#x6863;&#x3001;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x3001;&#x53EF;&#x4FE1;&#x5EA6;&#x7B49;&#x65B9;&#x9762;&#xFF0C;<code>&#x6A21;&#x5757;</code>&#x5929;&#x751F;&#x8981;&#x597D;&#x4E8E;<code>&#x7EC4;&#x4EF6;</code>&#x3002;&#x77E5;&#x9053;<code>domain</code>&#x662F;&#x6A21;&#x5757;&#xFF0C;&#x81EA;&#x7136;&#x4F1A;&#x53BB;node.js&#x5B98;&#x7F51;&#x67E5;&#x627E;&#x6700;&#x53EF;&#x9760;&#x7684;&#x8D44;&#x6599;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x5B98;&#x65B9;&#x8BA1;&#x5212;&#x5E9F;&#x5F03;<code>domain</code>&#xFF0C;&#x4E0D;&#x63D0;&#x5021;&#x518D;&#x4F7F;&#x7528;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x7684;&#x505A;&#x6CD5;&#x5C31;&#x662F;&#x89E3;&#x8BFB;&#x6982;&#x5FF5;&#xFF08;&#x5B98;&#x65B9;&#x63D0;&#x4F9B;&#xFF09;&#x3001;&#x63D0;&#x70BC;&#x6982;&#x5FF5;&#xFF08;&#x5B98;&#x65B9;&#x6CA1;&#x6709;&#xFF09;&#x3001;&#x89E3;&#x91CA;&#x6982;&#x5FF5;&#xFF08;&#x4ECB;&#x7ECD;&#x7528;&#x6CD5;&#xFF09;&#xFF0C;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x68B3;&#x7406;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x6982;&#x5FF5;&#x4E0D;&#x4EE5;&#x201C;&#x5168;&#x201D;&#x4E3A;&#x76EE;&#x6807;&#xFF0C;&#x4EE5;&#x201C;&#x597D;&#x8BB0;&#x3001;&#x597D;&#x7528;&#x3001;&#x597D;&#x533A;&#x5206;&#x201D;&#x4E3A;&#x4E3B;&#x3002;</p>
<p>&#x6211;&#x76F8;&#x4FE1;&#xFF0C;&#x4EE5;&#x540E;&#x4ECB;&#x7ECD;&#x7684;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x6216;&#x6A21;&#x5757;&#xFF0C;&#x7F51;&#x4E0A;&#x90FD;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x76F8;&#x5173;&#x6587;&#x6863;&#x3002;&#x6211;&#x7684;&#x505A;&#x6CD5;&#x81EA;&#x7136;&#x4E5F;&#x89C4;&#x907F;&#x4E86;&#x6587;&#x5B57;&#x96F7;&#x540C;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x6BD5;&#x7ADF;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x53EF;&#x4EE5;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#xFF0C;&#x4EE5;commander&#x3001;domain&#x548C;async&#x5728;app.js&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x987A;&#x5E8F;&#x4E3A;&#x51C6;&#xFF0C;&#x5206;&#x522B;&#x4ECB;&#x7ECD;&#x3002;</p>
<h2 id="commander">Commander</h2>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;Node.js&#x6216;ruby&#x7B49;&#x8BED;&#x8A00;&#x73AF;&#x5883;&#x91CC;&#xFF0C;&#x53EA;&#x8981;&#x5728;&#x6587;&#x4EF6;&#x5934;&#x90E8;&#x6DFB;&#x52A0;&#x4E00;&#x884C;&#x6240;&#x8C13;&#x7684;<code>shebang</code>(&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;)&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x4EE3;&#x7801;&#x8F6C;&#x4E3A;&#x547D;&#x4EE4;&#x884C;&#x6267;&#x884C;&#x3002;&#x96BE;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x5904;&#x7406;&#x548C;&#x6D41;&#x7A0B;&#x63A7;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x6709;&#x4E86;&#x8FD9;&#x7C7B;&#x5DE5;&#x5177;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x53EB;&#x5B83;&#x4EEC;<code>&#x547D;&#x4EE4;&#x884C;&#x6846;&#x67B6;</code>&#x6700;&#x5408;&#x9002;&#x3002;</p>
<p>&#x7C7B;&#x4F3C;<code>Commander</code>&#x7684;&#x5DE5;&#x5177;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x591A;&#x6570;&#x4EE5;&#x89C4;&#x8303;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x4E3A;&#x4E3B;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x7F16;&#x7801;&#x7EC6;&#x8282;&#x8FD8;&#x8981;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x4F55;&#x65F6;&#x9000;&#x51FA;&#x7A0B;&#x5E8F;(&#x8C03;&#x7528;<code>process.exit(1)</code>)&#x3002;<code>Commander</code>&#x628A;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x7B80;&#x5316;&#x4E86;&#xFF0C;&#x5C0F;&#x5DE7;&#x7075;&#x6D3B;&#x3001;&#x7B80;&#x5355;&#x6613;&#x7528;&#xFF0C;&#x6709;&#x5B83;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
<h4 id="1&#x6982;&#x5FF5;&#x5B9A;&#x4E49;">1.&#x6982;&#x5FF5;&#x5B9A;&#x4E49;</h4>
<p>&#x7B80;&#x5355;&#x76F4;&#x63A5;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x5F00;&#x53D1;&#x7EC4;&#x4EF6;&#x3002;</p>
<h4 id="2&#x6982;&#x5FF5;&#x89E3;&#x91CA;">2.&#x6982;&#x5FF5;&#x89E3;&#x91CA;</h4>
<ul>
<li>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;<code>&#x7EC4;&#x4EF6;</code>&#xFF0C;&#x8BF4;&#x660E;&#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5F00;&#x53D1;<code>Express</code>&#x7684;&#x5927;&#x795E;<code>tj</code>&#x5F00;&#x53D1;&#x7684;&#x3002;ruby&#x8BED;&#x8A00;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x540C;&#x540D;&#x7684;&#x5F00;&#x53D1;&#x7EC4;&#x4EF6;&#xFF0C;&#x540C;&#x6837;&#x662F;<code>tj</code>&#x7684;&#x6770;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x867D;&#x4E3A;&#x7EC4;&#x4EF6;&#xFF0C;&#x4F46;&#x8DB3;&#x591F;&#x6743;&#x5A01;&#xFF0C;&#x201C;<code>&#x60A8;&#x503C;&#x5F97;&#x62E5;&#x6709;</code>&#x201D;&#x3002;</li>
<li><code>&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x5F00;&#x53D1;</code>&#xFF0C;<code>Commander</code>&#x7684;&#x82F1;&#x6587;&#x89E3;&#x91CA;&#x662F;<code>&#x547D;&#x4EE4;</code>&#xFF0C;&#x5982;&#x5176;&#x540D;&#x5B57;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x7528;&#x6765;&#x5F00;&#x53D1;&#x547D;&#x4EE4;&#x884C;<code>&#x547D;&#x4EE4;</code>&#x7684;&#x3002;</li>
<li><code>&#x7B80;&#x5355;&#x76F4;&#x63A5;</code>&#xFF0C;&#x600E;&#x4E48;&#x7B80;&#x5355;&#xFF1F;<code>&#x56DB;&#x4E2A;&#x51FD;&#x6570;</code>&#x800C;&#x5DF2;&#x3002;&#x600E;&#x4E48;&#x76F4;&#x63A5;&#xFF1F;&#x5982;&#x679C;&#x60A8;&#x4E86;&#x89E3;&#x201C;&#x547D;&#x4EE4;&#x884C;&#x201D;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x80FD;&#x4F53;&#x4F1A;&#x6DF1;&#x523B;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x5305;&#x542B;&#x547D;&#x4EE4;&#x3001;&#x9009;&#x9879;&#x3001;&#x5E2E;&#x52A9;&#x548C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x56DB;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x8BE5;&#x7EC4;&#x4EF6;&#x5206;&#x522B;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x5E94;&#x51FD;&#x6570;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x53EA;&#x8981;&#x8BB0;&#x4F4F;&#x8BE5;Commander&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x548C;&#x8FD9;&#x4E00;&#x53E5;&#x8BDD;&#x7684;&#x6982;&#x5FF5;&#x5B9A;&#x4E49;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x5DF2;&#x7ECF;&#x638C;&#x63E1;&#x4E86;&#x8BE5;&#x7EC4;&#x4EF6;&#x7684;&#x5168;&#x90E8;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x7528;&#x6CD5;&#x4ECB;&#x7ECD;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5E2E;&#x52A9;&#x60A8;&#x66F4;&#x597D;&#x7684;&#x8BB0;&#x5FC6;&#x548C;&#x4F7F;&#x7528;&#x3002;</p>
<h4 id="3&#x7528;&#x6CD5;&#x4ECB;&#x7ECD;&#xFF1A;">3.&#x7528;&#x6CD5;&#x4ECB;&#x7ECD;&#xFF1A;</h4>
<p>&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x7ED9;&#x5B83;&#x6982;&#x5FF5;&#x5316;&#xFF0C;&#x53EB;&#x201C;&#x547D;&#x4EE4;&#x884C;&#x5F00;&#x53D1;&#x4E09;&#x6B65;&#x66F2;&#x201D;&#x3002;&#x5177;&#x4F53;&#x4EE5; <a href="https://github.com/imfly/gitbook-summary" target="_blank">gitbook-summary</a>&#x4E3A;&#x4F8B;&#xFF0C;&#x89E3;&#x91CA;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x7B2C;1&#x6B65;&#xFF1A;&#x7ED9;&#x5DE5;&#x5177;&#x8D77;&#x540D;&#x5B57;</li>
</ul>
<p>&#x8FD9;&#x4E2A;<code>&#x540D;&#x5B57;</code>&#xFF0C;&#x662F;&#x5DE5;&#x5177;&#x7684;&#x540D;&#x5B57;&#xFF08;&#x5176;&#x5B9E;&#x4E5F;&#x662F;<code>&#x547D;&#x4EE4;</code>&#xFF0C;&#x6211;&#x53EB;&#x5B83;&#x4E3B;&#x547D;&#x4EE4;&#xFF09;&#xFF0C;&#x7528;&#x6765;&#x533A;&#x5206;&#x7CFB;&#x7EDF;&#x547D;&#x4EE4;&#xFF0C;&#x9650;&#x5B9A;<code>&#x547D;&#x4EE4;</code>&#x4F7F;&#x7528;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x6211;&#x901A;&#x5E38;&#x7528;&#x5DE5;&#x7A0B;&#x7684;&#x540D;&#x5B57;&#x6216;&#x64CD;&#x4F5C;&#x5BF9;&#x8C61;&#x7684;&#x540D;&#x5B57;&#x4EE3;&#x66FF;&#xFF0C;&#x662F;&#x4E2A;&#x540D;&#x8BCD;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;<code>book</code>&#x3002;&#x800C;&#x7528;<code>Commander</code>&#x5199;&#x7684;<code>&#x547D;&#x4EE4;</code>&#x662F;&#x4E2A;&#x52A8;&#x8BCD;&#xFF08;&#x5176;&#x5B9E;&#x662F;&#x7528;.command()&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#x7684;&#x5B50;&#x547D;&#x4EE4;&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;<code>generate</code>&#xFF0C;&#x6700;&#x540E;&#x7684;&#x5F62;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-bash">$ book generate [--options]
</code></pre>
<p>&#x53EA;&#x6240;&#x4EE5;&#x628A;&#x8D77;&#x540D;&#x5B57;&#x5355;&#x72EC;&#x63D0;&#x51FA;&#x6765;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5728;Node.js&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x662F;<code>&#x56FA;&#x5B9A;&#x4E0D;&#x53D8;</code>&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x8BB0;&#x4F4F;&#x5C31;&#x662F;&#x4E86;&#x3002;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5728;<code>package.json</code>&#x91CC;&#x5B9A;&#x4E49;&#x4E0B;&#x9762;&#x7684;&#x5B57;&#x6BB5;&#xFF1A;</p>
<pre><code>{
  &quot;bin&quot;: {
    &quot;book&quot;: &quot;./path/to/your-commander.js&quot;
  }
}
</code></pre><p><strong>&#x6CE8;</strong>&#xFF1A;<code>package.json</code>&#x6587;&#x4EF6;&#x662F;&#x5305;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x662F;&#x5168;&#x5C40;&#x914D;&#x7F6E;&#x4E0D;&#x53EF;&#x903E;&#x8D8A;&#x4E4B;&#x5730;&#x3002;&#x5F88;&#x591A;&#x5DE5;&#x5177;&#xFF0C;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x5B83;&#xFF0C;&#x63D0;&#x4F9B;&#x5165;&#x53E3;&#x7A0B;&#x5E8F;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;Node.js&#x81EA;&#x5DF1;&#x5C31;&#x662F;&#x8BF7;&#x6C42;<code>main</code>&#x5B57;&#x6BB5;&#x7684;&#xFF08;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#xFF0C;&#x9ED8;&#x8BA4;&#x8BF7;&#x6C42;index.js&#x6587;&#x4EF6;)&#xFF0C;Npm&#x8BF7;&#x6C42;<code>scripts</code>&#x5B57;&#x6BB5;&#x3002;&#x8FD9;&#x91CC;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#xFF0C;Commander&#x8BF7;&#x6C42;<code>bin</code>&#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x5982;&#x679C;&#xFF0C;&#x4E0D;&#x4F7F;&#x7528;<code>package.json</code>&#xFF0C;&#x90A3;&#x4E48;&#x5B9A;&#x4E49;&#x7684;&#x5C31;&#x662F;<code>node</code>&#x547D;&#x4EE4;&#x4E4B;&#x4E0B;&#x7684;&#x5B50;&#x547D;&#x4EE4;&#xFF0C;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x662F;&#xFF1A;</p>
<pre><code>$ node ./path/to/your-commander.js generate [--options]
</code></pre><p>&#x5982;&#x679C;&#x8FDE;node&#x90FD;&#x4E0D;&#x60F3;&#x8F93;&#x5165;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x5728;&#x4EE3;&#x7801;&#x7B2C;&#x4E00;&#x884C;&#x6DFB;&#x52A0;<code>shebang</code>&#xFF0C;&#x5373;&#xFF1A;</p>
<pre><code>#!/usr/bin/env node
</code></pre><ul>
<li>&#x7B2C;2&#x6B65;&#xFF1A;&#x586B;&#x5145;&#x56DB;&#x4E2A;&#x51FD;&#x6570;</li>
</ul>
<p>&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x547D;&#x4EE4;&#x3001;&#x9009;&#x9879;&#x3001;&#x5E2E;&#x52A9;&#x548C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x5B8C;&#x5168;&#x662F;<code>Commander</code>&#x6982;&#x5FF5;&#x5B9A;&#x4E49;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x7B2C;&#x4E09;&#x65B9;&#x7EC4;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8D77;&#x5230;&#x8FD9;&#x79CD;<code>&#x5FAE;&#x6846;&#x67B6;</code>&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5177;&#x4F53;&#x7528;&#x6CD5;&#xFF0C;&#x81EA;&#x7136;&#x6700;&#x597D;&#x662F;&#x770B; <a href="https://github.com/tj/commander.js" target="_blank">&#x5B98;&#x65B9;&#x6587;&#x6863;</a> &#x4E86;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x601D;&#x8003;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x7EC4;&#x4EF6;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x56DB;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x60F3;&#x5230;&#x7684;&#x901A;&#x5E38;&#x662F;<code>&#x4E1A;&#x52A1;&#x903B;&#x8F91;</code>&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x53EA;&#x8981;&#x662F;&#x5F00;&#x53D1;&#xFF0C;&#x903B;&#x8F91;&#x90E8;&#x5206;&#x81EA;&#x7136;&#x53EA;&#x80FD;&#x5F00;&#x53D1;&#x8005;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;<code>Commander</code>&#x4EC5;&#x4EC5;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x51FD;&#x6570;&#x800C;&#x5DF2;&#x3002;&#x8FD9;&#x91CC;&#x7684;<code>&#x547D;&#x4EE4;</code>&#xFF0C;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x3002;<code>&#x5E2E;&#x52A9;</code>&#x662F;&#x63D0;&#x793A;&#xFF0C;&#x4E5F;&#x4EC5;&#x662F;&#x7B80;&#x5355;&#x7684;&#x6587;&#x672C;&#x4FE1;&#x606F;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x5404;&#x79CD;<code>&#x9009;&#x9879;</code>&#xFF0C;&#x53EF;&#x4EE5;&#x89C4;&#x8303;&#xFF0C;&#x4E5F;&#x6700;&#x4E3A;&#x5173;&#x952E;&#xFF0C;&#x624D;&#x662F;<code>Commander</code>&#x7684;&#x53EF;&#x7231;&#x4E4B;&#x5904;&#x3002;</p>
<p>&#xFF08;1&#xFF09;<strong>&#x547D;&#x4EE4;</strong>&#xFF1A; &#x4F7F;&#x7528;<code>command</code>&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF08;&#x5B50;&#x547D;&#x4EE4;&#xFF09;&#xFF0C;&#x4F8B;&#x5982;</p>
<pre><code>var program = require(&quot;commander&quot;);

program
    .command(&quot;summary &lt;cmd&gt;&quot;)
    .alias(&quot;sm&quot;) //&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x522B;&#x540D;
    .description(&quot;generate a `SUMMARY.md` from a folder&quot;) //&#x63CF;&#x8FF0;&#xFF0C;&#x4F1A;&#x663E;&#x793A;&#x5728;&#x5E2E;&#x52A9;&#x4FE1;&#x606F;&#x91CC;
...
</code></pre><p>&#x5F53;&#x4F7F;&#x7528;<code>-h</code>&#x9009;&#x9879;&#x8C03;&#x7528;&#x547D;&#x4EE4;&#x65F6;&#xFF0C;&#x4E0A;&#x8FF0;&#x547D;&#x4EE4;<code>summary|sm</code>&#x4F1A;&#x88AB;&#x663E;&#x793A;&#x5728;&#x5E2E;&#x52A9;&#x4FE1;&#x606F;&#x91CC;&#x3002;&#x8FD9;&#x91CC;&#x7684;<code>alias</code>&#x548C;<code>description</code>&#x4EC5;&#x662F;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x66F4;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x4E0B;&#x9762;<a href="https://github.com/tj/commander.js/blob/master/examples/pm" target="_blank">&#x5B98;&#x65B9;&#x7684;&#x4F8B;&#x5B50;</a>&#xFF0C; .command() &#x5305;&#x542B;&#x4E86;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x548C; .action(callback) &#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x8981;&#x7528;&#x5B50;&#x547D;&#x4EE4;&#x5404;&#x81EA;&#x5BF9;&#x5E94;&#x7684;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x662F;./pm-install.js&#xFF0C;&#x4EE5;&#x53CA; ./pm-search.js &#x548C; ./pm-list.js&#x7B49;&#x3002;</p>
<pre><code>#!/usr/bin/env node

var program = require(&apos;..&apos;);

program
  .version(&apos;0.0.1&apos;)
  .command(&apos;install [name]&apos;, &apos;install one or more packages&apos;)
  .command(&apos;search [query]&apos;, &apos;search with optional query&apos;)
  .command(&apos;list&apos;, &apos;list packages installed&apos;)
  .command(&apos;publish&apos;, &apos;publish the package&apos;)
  .parse(process.argv);
</code></pre><p><strong>&#x8BF4;&#x660E;</strong>&#xFF1A;&#x4E0D;&#x4F7F;&#x7528;<code>command</code>&#x65B9;&#x6CD5;&#x76F4;&#x63A5;&#x5B9A;&#x4E49;&#x4E3B;&#x547D;&#x4EE4;&#xFF0C;&#x4E2A;&#x4EBA;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x4E2D;&#x89C4;&#x4E2D;&#x77E9;&#x5730;&#x5B9A;&#x4E49;&#x6BCF;&#x4E00;&#x4E2A;&#x5B50;&#x547D;&#x4EE4;&#xFF08;&#x672C;&#x6587;&#x7EDF;&#x79F0;&#x547D;&#x4EE4;&#xFF09;&#xFF0C;&#x53EA;&#x8981;&#x4F7F;&#x7528;<code>command</code>&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x5E26;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x9644;&#x5E26;<code>action</code>&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x5B9A;&#x4E49;&#x7C7B;&#x4F3C;git&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x4E00;&#x8FDE;&#x4E32;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x6765;&#xFF0C;&#x663E;&#x7136;&#x9EBB;&#x70E6;&#xFF0C;&#x5C31;&#x628A;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x653E;&#x5728;<code>command</code>&#x91CC;&#xFF0C;&#x53BB;&#x6389;<code>action</code>&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x65F6;&#x9ED8;&#x8BA4;&#x8BF7;&#x6C42;&#x5BF9;&#x5E94;&#x7684;js&#x6587;&#x4EF6;&#x3002;</p>
<p>&#xFF08;2&#xFF09;<strong>&#x9009;&#x9879;</strong>&#xFF1A;&#x4F7F;&#x7528;<code>option</code>&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;<code>&#x547D;&#x4EE4;&#x884C;&#x6570;&#x636E;&#x7ED3;&#x6784;</code>&#x3002;</p>
<p>&#x8BE5;&#x51FD;&#x6570;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x7684;&#x5C06;&#x6587;&#x672C;&#x8F93;&#x5165;&#x8F6C;&#x5316;&#x4E3A;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#x5F62;&#x5F0F;&#x3002;&#x5176;&#x529F;&#x80FD;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4EFB;&#x4F55;&#x6570;&#x91CF;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;<code>.option</code>&#x51FD;&#x6570;&#x8C03;&#x7528;;</li>
<li>&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x9ED8;&#x8BA4;&#x503C;;</li>
<li>&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6587;&#x672C;&#x3001;&#x6570;&#x503C;&#x3001;&#x6570;&#x7EC4;&#x3001;&#x96C6;&#x5408;&#x548C;&#x8303;&#x56F4;&#x7B49;&#x7EA6;&#x675F;&#x7C7B;&#x578B;&#xFF08;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x5904;&#x7406;&#x51FD;&#x6570;&#xFF09;;</li>
<li>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;;</li>
</ul>
<p><strong>&#x8BF4;&#x660E;</strong>&#xFF1A;<code>option</code>&#x65B9;&#x6CD5;&#xFF0C;&#x57FA;&#x672C;&#x4F7F;&#x7528;&#x5C31;&#x7528;&#x9009;&#x9879;&#x540D;&#x79F0;&#x548C;&#x63CF;&#x8FF0;;&#x590D;&#x6742;&#x4E00;&#x70B9;&#x5C31;&#x8981;&#x63D0;&#x4F9B;&#x5904;&#x7406;&#x51FD;&#x6570;&#x6216;&#x9ED8;&#x8BA4;&#x503C;;&#x518D;&#x590D;&#x6742;&#x5C31;&#x7528;<code>arguments</code>&#x65B9;&#x6CD5;&#x4EE3;&#x66FF;<code>option</code>&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;<code>&#x53EF;&#x53D8;&#x53C2;&#x6570;</code>&#xFF08;&#x5E26;<code>...</code>&#x7684;&#x53C2;&#x6570;&#xFF09;&#x3002;</p>
<p>&#xFF08;3&#xFF09;<strong>&#x5E2E;&#x52A9;</strong>&#xFF1A; &#x4F7F;&#x7528;<code>help</code>&#x65B9;&#x6CD5;&#x8F93;&#x51FA;&#x4E00;&#x5207;&#x6709;&#x7528;&#x7684;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x901A;&#x5E38;&#x5728;&#x547D;&#x4EE4;&#x548C;&#x9009;&#x9879;&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;</p>
<pre><code>program.help();
</code></pre><p>&#x5982;&#x679C;&#x8981;&#x5B9A;&#x5236;&#x5E2E;&#x52A9;&#x4FE1;&#x606F;&#xFF0C;&#x5C31;&#x7528;&#xFF1A;</p>
<pre><code>program.on(&apos;--help&apos;,cb);
</code></pre><p>&#xFF08;4&#xFF09;<strong>&#x903B;&#x8F91;</strong>&#xFF1A; &#x4F7F;&#x7528;<code>action</code>&#x65B9;&#x6CD5;&#x6CE8;&#x518C;&#x903B;&#x8F91;&#xFF0C;&#x5C06;&#x4EE3;&#x7801;&#x8F6C;&#x5411;&#x6267;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x903B;&#x8F91;&#x4EE3;&#x7801;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;git&#x7C7B;&#x578B;&#x7684;&#x591A;&#x547D;&#x4EE4;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x3002;&#x4F8B;&#x5982;</p>
<pre><code>program.action(function(cmd, options) { //code });
</code></pre><ul>
<li>&#x7B2C;3&#x6B65;&#xFF1A;&#x5F00;&#x53D1;&#x4E1A;&#x52A1;&#x903B;&#x8F91;</li>
</ul>
<p>&#x64B0;&#x5199;<code>action</code>&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x662F;&#x4E86;&#x3002;</p>
<h4 id="4&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;">4.&#x6848;&#x4F8B;&#x5206;&#x6790;&#xFF1A;</h4>
<p>&#x4EE3;&#x7801;&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/imfly/gitbook-summary" target="_blank">https://github.com/imfly/gitbook-summary</a> &#x5177;&#x4F53;&#x5185;&#x5BB9;&#xFF0C;&#x8BF7;&#x81EA;&#x5DF1;&#x770B;&#x4EE3;&#x7801;&#x5427;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x952E;&#x751F;&#x6210;&#x6587;&#x6863;&#x76EE;&#x5F55;&#x6587;&#x4EF6;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x4EE5;&#x540E;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x52A0;&#x5165;&#x7B80;&#x7E41;&#x8F6C;&#x5316;&#x529F;&#x80FD;&#x3002;&#x751F;&#x6210;&#x7684;&#x76EE;&#x5F55;&#x6587;&#x4EF6;&#xFF0C;&#x662F;gitbook&#x751F;&#x6210;&#x7535;&#x5B50;&#x4E66;&#x7684;&#x5FC5;&#x987B;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x613F;&#x610F;&#x4E3A;&#x5199;&#x4F5C;&#x800C;&#x5199;&#x4F5C;&#xFF0C;&#x66F4;&#x4E0D;&#x613F;&#x610F;&#x5904;&#x7406;&#x4EFB;&#x4F55;&#x91CD;&#x590D;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x9694;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x7ECF;&#x5E38;&#x79EF;&#x7D2F;&#x4E00;&#x5806;&#x95EE;&#x9898;&#x6E05;&#x5355;&#x548C;&#x96F6;&#x96F6;&#x6563;&#x6563;&#x7684;&#x6587;&#x6863;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x57FA;&#x672C;&#x4E0A;&#x4E3A;&#x81EA;&#x5DF1;&#x5B9A;&#x5236;&#x3002;&#x4F46;&#x53D1;&#x73B0;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x5C0F;&#x76C6;&#x53CB;&#x5728;&#x7528;&#xFF0C;&#x770B;&#x6765;&#x8DDF;&#x6211;&#x4E00;&#x6837;&#xFF0C;^_^&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x8FD9;&#x7BC7;&#x4EC5;&#x4EC5;&#x4ECB;&#x7ECD;&#x4E86;<code>commander</code>&#x7EC4;&#x4EF6;&#x7684;&#x76F8;&#x5173;&#x6982;&#x5FF5;&#x548C;&#x4F7F;&#x7528;&#xFF0C;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5B89;&#x88C5;&#xFF08;&#x7B80;&#x5355;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#xFF09;&#x3001;&#x5982;&#x4F55;&#x4FEE;&#x6539;&#x6743;&#x9650;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x7EC6;&#x8BF4;&#x3002;&#x8FD9;&#x7C7B;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x575A;&#x4FE1;&#x7F51;&#x4E0A;&#x4E00;&#x641C;&#x591A;&#x7684;&#x662F;&#xFF0C;&#x81EA;&#x884C;&#x8865;&#x5145;&#x5427;&#x3002;</p>
<p>&#x539F;&#x672C;&#x628A;&#x4E09;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF08;&#x6A21;&#x5757;&#xFF09;&#x4E00;&#x8D77;&#x6574;&#x7406;&#x53D1;&#x5E03;&#x7684;&#xFF0C;&#x53D1;&#x73B0;&#x5199;&#x5230;&#x8FD9;&#x5DF2;&#x7ECF;&#x5F88;&#x957F;&#x4E86;&#xFF0C;&#x53EA;&#x597D;&#x4E34;&#x65F6;&#x6539;&#x53D8;&#xFF0C;&#x5355;&#x72EC;&#x53D1;&#x5E03;&#x4E86;&#x3002;</p>
<h2 id="&#x94FE;&#x63A5;">&#x94FE;&#x63A5;</h2>
<p><strong>&#x672C;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x5373;&#x65F6;&#x66F4;&#x65B0;&#xFF0C;&#x82E5;&#x8981;&#x638C;&#x63E1;&#x6700;&#x65B0;&#x5185;&#x5BB9;&#xFF0C;&#x8BF7;&#x5173;&#x6CE8;&#x4E0B;&#x9762;&#x7684;&#x94FE;&#x63A5;</strong></p>
<p>&#x672C;&#x6E90;&#x6587;&#x5730;&#x5740;&#xFF1A; <a href="https://github.com/imfly/bitcoin-on-nodejs" target="_blank">https://github.com/imfly/bitcoin-on-nodejs</a></p>
<p>&#x7535;&#x5B50;&#x4E66;&#x9605;&#x8BFB;&#xFF1A; <a href="http://bitcoin-on-nodejs.ebookchain.org/4-&#x5F00;&#x53D1;&#x5B9E;&#x8DF5;/1-commander&#x4ECB;&#x7ECD;.html" target="_blank">http://bitcoin-on-nodejs.ebookchain.org</a></p>
<p>&#x7535;&#x5B50;&#x4E66;&#x4E0B;&#x8F7D;&#xFF1A; <a href="https://www.gitbook.com/book/imfly/bitcoin-on-nodejs/details" target="_blank">&#x4E0B;&#x8F7D;&#x9875;&#x9762;</a> <a href="https://www.gitbook.com/download/pdf/book/imfly/bitcoin-on-nodejs" target="_blank">PDF&#x6587;&#x4EF6;</a> <a href="https://www.gitbook.com/download/epub/book/imfly/bitcoin-on-nodejs" target="_blank">ePub&#x6587;&#x4EF6;</a> <a href="https://www.gitbook.com/download/mobi/book/imfly/bitcoin-on-nodejs" target="_blank">Mobi&#x6587;&#x4EF6;</a></p>
<h2 id="&#x53C2;&#x8003;">&#x53C2;&#x8003;</h2>
<p>Node.js &#x547D;&#x4EE4;&#x884C;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x6559;&#x7A0B;&#xFF08;&#x4E2D;&#x6587;&#xFF09;: <a href="http://www.ruanyifeng.com/blog/2015/05/command-line-with-node.html" target="_blank">http://www.ruanyifeng.com/blog/2015/05/command-line-with-node.html</a></p>
<p>&#x7528;npm&#x6784;&#x5EFA;&#x7B80;&#x5355;&#x547D;&#x4EE4;&#x884C;&#xFF08;&#x82F1;&#x6587;&#xFF09;: <a href="http://blog.npmjs.org/post/118810260230/building-a-simple-command-line-tool-with-npm" target="_blank">http://blog.npmjs.org/post/118810260230/building-a-simple-command-line-tool-with-npm</a></p>
<p>&#x7528;Node.js&#x5F00;&#x53D1;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF08;&#x82F1;&#x6587;&#xFF09;: <a href="http://shapeshed.com/command-line-utilities-with-node.js/" target="_blank">http://shapeshed.com/command-line-utilities-with-node.js/</a></p>

                            </div>
                            
                        
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                    </div>
                </div>
            </div>
        </div>
    </div>

    <footer class="gb-page-footer">
        <div class="container">
            <ul class="menu">
                <li class="pull-right">
                    <span class="service-info">Copyright GitBook 2016</span>
                </li>
                <li>
                    <a href="#">Return to the top</a>
                </li>
                <li>
                    <a href="#">Updated Jun 24th 16</a>
                </li>
            </ul>
        </div>
    </footer>
</div>

<script src="../../gitbook/gitbook.js"></script>

    
    <script src="../../gitbook/gitbook-plugin-baidu/plugin.js"></script>
    

    
    <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
    

    
    <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
    

    
    <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
    

    
    <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
    

<script>
(function() {
    gitbook.page.hasChanged({"page":{"title":"commander介绍","level":"1.6.2.1","depth":3,"next":{"title":"客户端开发","level":"1.6.3","depth":2,"path":"4-开发实践/2-客户端开发/readme.md","ref":"4-开发实践/2-客户端开发/readme.md","articles":[{"title":"静态网站开发全景扫描","level":"1.6.3.1","depth":3,"path":"4-开发实践/2-客户端开发/4-静态网站开发全景扫描.md","ref":"4-开发实践/2-客户端开发/4-静态网站开发全景扫描.md","articles":[]},{"title":"一张图把握Ember开发的精髓","level":"1.6.3.2","depth":3,"path":"4-开发实践/2-客户端开发/5-一张图把握Ember开发的精髓.md","ref":"4-开发实践/2-客户端开发/5-一张图把握Ember开发的精髓.md","articles":[]},{"title":"一张图掌握把前端拆成可重用的Ember插件","level":"1.6.3.3","depth":3,"path":"4-开发实践/2-客户端开发/6-一张图掌握把前端拆成可重用的Ember插件.md","ref":"4-开发实践/2-客户端开发/6-一张图掌握把前端拆成可重用的Ember插件.md","articles":[]},{"title":"Ember的所有钩子方法汇总","level":"1.6.3.4","depth":3,"path":"4-开发实践/2-客户端开发/7-Ember的所有钩子方法汇总.md","ref":"4-开发实践/2-客户端开发/7-Ember的所有钩子方法汇总.md","articles":[]}]},"previous":{"title":"命令行设计","level":"1.6.2","depth":2,"path":"4-开发实践/1-命令行设计/readme.md","ref":"4-开发实践/1-命令行设计/readme.md","articles":[{"title":"commander介绍","level":"1.6.2.1","depth":3,"path":"4-开发实践/1-命令行设计/1-commander介绍.md","ref":"4-开发实践/1-命令行设计/1-commander介绍.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["baidu","theme-official","-livereload"],"license":"MIT","ignores":["backup","_book","styles","assets","node_modules","sources","doc"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"baidu":{"token":"a489cddfaf5ed40abc3a60e2783e8019"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-official":{},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}}},"theme":"default","repository":{"type":"git","url":"https://github.com/imfly/bitcoin-on-nodejs.git"},"keywords":["bitcoin","nodejs"],"author":"Imfly","homepage":"http://imfly.github.io/bitcoin-on-nodejs","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bookname":"Nodejs开发加密货币","sortedBy":"-","variables":{},"language":"zh","gitbook":"*","description":"第一本详细讲解Nodejs在加密货币领域应用的免费电子书籍","bugs":{"url":"https://github.com/imfly/bitcoin-on-nodejs/issues"}},"file":{"path":"4-开发实践/1-命令行设计/1-commander介绍.md","mtime":"2016-06-24T11:40:33.244Z","type":"markdown"},"gitbook":{"version":"3.1.1","time":"2016-06-26T06:14:01.770Z"},"basePath":"../..","book":{"language":""}});
})();
</script>

    </body>
</html>

