
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <title>加密货币相关名词汇总 · GitBook</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.1.1">
        <meta name="author" content="Imfly">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="shortcut icon" href="../gitbook/images/logo/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    

    
    <link rel="next" href="2-关于亿书.html" />
    
    
    <link rel="prev" href="readme.html" />
    

    </head>
    <body>
        
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


            <a href="/" class="logo">
                <img src="../gitbook/images/logo/128.png">
                <h1></h1>
            </a>

            

            
                
                <a href="2-关于亿书.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-right"></i>
                </a>
                
                
                <a href="readme.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-left"></i>
                </a>
                
            
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default">
        

        <div class="list-group">
            
    
        
        <a href="../" class="list-group-item ">
        
            
            Introduction
        
        </a>
        

        
    
        
        <a href="../0-开篇的话/readme.html" class="list-group-item ">
        
            
            开篇的话
        
        </a>
        

        
    
        
        <a href="../1-了解加密货币/readme.html" class="list-group-item ">
        
            
            了解加密货币
        
        </a>
        

        
    
        
        <a href="../2-Node.js入门指南/readme.html" class="list-group-item ">
        
            
            Node.js入门指南
        
        </a>
        

        
    
        
        <a href="../3-源码解读/readme.html" class="list-group-item ">
        
            
            源码解读
        
        </a>
        

        
    
        
        <a href="../4-开发实践/readme.html" class="list-group-item ">
        
            
            开发实践
        
        </a>
        

        
    
        
        <a href="readme.html" class="list-group-item ">
        
            
            附录
        
        </a>
        

        
        
    
        
        <a href="1-加密货币相关名词汇总.html" class="list-group-item active">
        
            
            加密货币相关名词汇总
        
        </a>
        

        
    
        
        <a href="2-关于亿书.html" class="list-group-item ">
        
            
            关于亿书
        
        </a>
        

        
    
        
        <a href="3-关于区款链俱乐部.html" class="list-group-item ">
        
            
            关于区款链俱乐部
        
        </a>
        

        
    
        
        <a href="4-关于作者.html" class="list-group-item ">
        
            
            关于作者
        
        </a>
        

        
    

        
    
        
        <a href="../6-后记/readme.html" class="list-group-item ">
        
            
            后记
        
        </a>
        

        
    

        </div>
    </div>
    


                    </div>
                    <div class="col-md-9">
                        
<div id="book-search-results">
    <div class="search-noresults">
    
                            
                            <div class="gb-markdown book-page-inner">
                                <h1 id="&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x76F8;&#x5173;&#x540D;&#x8BCD;&#x6C47;&#x603B;">&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x76F8;&#x5173;&#x540D;&#x8BCD;&#x6C47;&#x603B;</h1>
<h2 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h2>
<p>&#x65B0;&#x6280;&#x672F;&#x7684;&#x6700;&#x5927;&#x95EE;&#x9898;&#x662F;&#x65B0;&#x6982;&#x5FF5;&#x592A;&#x591A;&#x3002;&#x4F8B;&#x5982;&#x52A0;&#x5BC6;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5305;&#x62EC;&#x6563;&#x5217;&#x3001;&#x7B7E;&#x540D;&#x3001;&#x516C;&#x94A5;&#x3001;&#x79C1;&#x94A5;&#x3001;&#x5BF9;&#x79F0;&#x548C;&#x4E0D;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x3001;&#x670D;&#x52A1;&#x4FDD;&#x62A4;&#x62D2;&#x7EDD;&#xFF0C;&#x8FD8;&#x6709;&#x5206;&#x5E03;&#x5F0F;&#x54C8;&#x5E0C;&#x8868;&#x3001;&#x4FE1;&#x4EFB;&#x7F51;&#x7EDC;&#x7B49;&#x3002;&#x8FD8;&#x6709;&#x989D;&#x5916;&#x7684;&#x5185;&#x90E8;&#x672F;&#x8BED;&#xFF0C;&#x5982;&#x201C;&#x533A;&#x5757;&#x201D;&#xFF0C;&#x201C;&#x786E;&#x8BA4;&#x201D;&#xFF0C;&#x201C;&#x6316;&#x77FF;&#x201D;&#xFF0C;&#x201C;SPV&#x5BA2;&#x6237;&#x201D;&#x548C;&#x201C;51&#xFF05;&#x653B;&#x51FB;&#x201D;&#xFF0C;&#x4EE5;&#x53CA;&#x7ECF;&#x6D4E;&#x6982;&#x5FF5;&#xFF0C;&#x5982;&#x6FC0;&#x52B1;&#x76F8;&#x5BB9;&#x3001;&#x96C6;&#x6743;&#x4E0E;&#x5206;&#x6743;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x7ECF;&#x5E38;&#x9047;&#x5230;&#x7684;&#x76F8;&#x5173;&#x8BCD;&#x6C47;&#x8FDB;&#x884C;&#x6C47;&#x603B;&#x3002;</p>
<h2 id="&#x5BC6;&#x7801;&#x5B66;">&#x5BC6;&#x7801;&#x5B66;</h2>
<p><strong>&#x8BA1;&#x7B97;&#x4E0A;&#x4E0D;&#x53EF;&#x884C;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x88AB;&#x79F0;&#x4E3A;&#x662F;&#x8BA1;&#x7B97;&#x4E0A;&#x4E0D;&#x53EF;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x60F3;&#x6709;&#x5174;&#x8DA3;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x4F46;&#x662F;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x4E00;&#x79CD;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x7684;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#xFF08;&#x5982;&#x51E0;&#x5341;&#x4EBF;&#x5E74;&#xFF09;&#x3002;&#x901A;&#x5E38;&#xFF0C;2&#x7684;80&#x6B21;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8BA1;&#x7B97;&#x4E0A;&#x4E0D;&#x53EF;&#x884C;&#x7684;&#x4E0B;&#x9650;&#x3002;</p>
<p><strong>&#x6563;&#x5217;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x6563;&#x5217;&#x51FD;&#x6570;&#xFF08;&#x6216;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#xFF0C;&#x4F9D;&#x9760;&#x8FD9;&#x4E2A;&#x5904;&#x7406;&#xFF0C;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#xFF08;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5757;&#x6216;&#x6587;&#x4EF6;&#xFF09;&#x88AB;&#x52A0;&#x5DE5;&#x6210;&#x770B;&#x8D77;&#x6765;&#x5B8C;&#x5168;&#x662F;&#x968F;&#x673A;&#x7684;&#x5C0F;&#x7247;&#x6570;&#x636E;&#xFF08;&#x901A;&#x5E38;&#x4E3A;32&#x4E2A;&#x5B57;&#x8282;&#xFF09;&#xFF0C;&#x4ECE;&#x4E2D;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x88AB;&#x590D;&#x539F;&#x4E3A;&#x6587;&#x6863;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6027;&#x80FD;&#x662F;&#x6563;&#x5217;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6587;&#x6863;&#x7684;&#x7ED3;&#x679C;&#x603B;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x6781;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x627E;&#x5230;&#x5177;&#x6709;&#x76F8;&#x540C;&#x6563;&#x5217;&#x7684;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x5728;&#x8BA1;&#x7B97;&#x4E0A;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5373;&#x4F7F;&#x6539;&#x53D8;&#x6587;&#x4EF6;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x4E5F;&#x5C06;&#x5B8C;&#x5168;&#x6253;&#x4E71;&#x6563;&#x5217;;&#x4F8B;&#x5982;&#xFF0C;&#x201C; Saturday&#x201D;&#x7684;SHA3&#x6563;&#x5217;&#x4E3A;c38bbc8e93c09f6ed3fe39b5135da91ad1a99d397ef16948606cdcbd14929f9d&#xFF0C;&#x800C;Caturday&#x7684;SHA3&#x6563;&#x5217;&#x662F;b4013c0eed56d5a0b448b02ec1d10dd18c1b3832068fbbdc65b98fa9b14b6dbf&#x3002;&#x6563;&#x5217;&#x503C;&#x7ECF;&#x5E38;&#x88AB;&#x7528;&#x4F5C;&#x4EE5;&#x4E0B;&#x7528;&#x9014;&#xFF1A;&#x4E3A;&#x65E0;&#x6CD5;&#x4F2A;&#x9020;&#x7684;&#x7279;&#x5B9A;&#x6587;&#x6863;&#x800C;&#x521B;&#x5EFA;&#x7684;&#x5168;&#x5C40;&#x5546;&#x5B9A;&#x6807;&#x8BC6;&#x7B26;&#x3002;</p>
<p><strong>&#x52A0;&#x5BC6;</strong>&#xFF1A;&#x4E0E;&#x88AB;&#x79F0;&#x4E3A;&#x94A5;&#x5319;&#xFF08;&#x4F8B;&#x5982;c85ef7d79691fe79573b1a7064c19c1a9819ebdbd1faaab1a8ec92344438aaf4&#xFF09;&#x7684;&#x77ED;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6570;&#x636E;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x5BF9;&#x6587;&#x6863;&#xFF08;&#x660E;&#x6587;&#xFF09;&#x6240;&#x8FDB;&#x884C;&#x7684;&#x5904;&#x7406;&#x3002;&#x52A0;&#x5BC6;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#xFF08;&#x5BC6;&#x6587;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BC6;&#x6587;&#x53EF;&#x4EE5;&#x88AB;&#x5176;&#x4ED6;&#x638C;&#x63E1;&#x8FD9;&#x4E2A;&#x94A5;&#x5319;&#x7684;&#x4EBA;&#x201C;&#x89E3;&#x5BC6;&#x201D;&#x56DE;&#x539F;&#x6765;&#x7684;&#x660E;&#x6587;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x638C;&#x63E1;&#x94A5;&#x5319;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x662F;&#x89E3;&#x5BC6;&#x662F;&#x8D39;&#x89E3;&#x7684;&#x4E14;&#x8BA1;&#x7B97;&#x4E0A;&#x4E0D;&#x53EF;&#x884C;&#x3002;</p>
<p><strong>&#x516C;&#x94A5;&#x52A0;&#x5BC6;</strong>&#xFF1A;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x52A0;&#x5BC6;&#xFF0C;&#x5177;&#x6709;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x751F;&#x6210;&#x4E24;&#x4E2A;&#x5BC6;&#x94A5;&#x7684;&#x5904;&#x7406;&#xFF08;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;&#xFF09;&#xFF0C;&#x4F7F;&#x5F97;&#x5229;&#x7528;&#x4E00;&#x4E2A;&#x94A5;&#x5319;&#x5BF9;&#x6587;&#x6863;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x94A5;&#x5319;&#x8FDB;&#x884C;&#x89E3;&#x5BC6;&#x3002;&#x4E00;&#x822C;&#x5730;&#xFF0C;&#x6B63;&#x5982;&#x5176;&#x540D;&#x5B57;&#x6240;&#x5EFA;&#x8BAE;&#x7684;&#xFF0C;&#x4E2A;&#x4EBA;&#x53D1;&#x5E03;&#x4ED6;&#x4EEC;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x5E76;&#x7ED9;&#x81EA;&#x5DF1;&#x4FDD;&#x7559;&#x79C1;&#x94A5;&#x3002;</p>
<p><strong>&#x6570;&#x5B57;&#x7B7E;&#x540D;</strong>&#xFF1A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7528;&#x79C1;&#x94A5;&#x4E3A;&#x6587;&#x6863;&#x4EA7;&#x751F;&#x4E00;&#x6BB5;&#x53EB;&#x505A;&#x7B7E;&#x540D;&#x7684;&#x77ED;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4EFB;&#x4F55;&#x62E5;&#x6709;&#x76F8;&#x5E94;&#x516C;&#x94A5;&#xFF0C;&#x7B7E;&#x540D;&#x548C;&#x6587;&#x6863;&#x7684;&#x4EBA;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#xFF08;1&#xFF09;&#x8BE5;&#x6587;&#x4EF6;&#x662F;&#x7531;&#x7279;&#x5B9A;&#x7684;&#x79C1;&#x94A5;&#x7684;&#x62E5;&#x6709;&#x8005;&#x201C;&#x7B7E;&#x540D;&#x201D;&#x7684;&#xFF0C;&#xFF08;2&#xFF09;&#x8BE5;&#x6587;&#x6863;&#x5728;&#x7B7E;&#x540D;&#x540E;&#x6CA1;&#x6709;&#x88AB;&#x6539;&#x53D8;&#x8FC7;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E0D;&#x540C;&#x4E8E;&#x4F20;&#x7EDF;&#x7684;&#x7B7E;&#x540D;&#xFF0C;&#x5728;&#x4F20;&#x7EDF;&#x7B7E;&#x540D;&#x4E0A;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x7B7E;&#x540D;&#x540E;&#x6D82;&#x62B9;&#x591A;&#x4F59;&#x7684;&#x6587;&#x5B57;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x6837;&#x505A;&#x65E0;&#x6CD5;&#x88AB;&#x5206;&#x8FA8;;&#x5728;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x540E;&#x4EFB;&#x4F55;&#x5BF9;&#x6587;&#x6863;&#x7684;&#x6539;&#x53D8;&#x4F1A;&#x4F7F;&#x7B7E;&#x540D;&#x65E0;&#x6548;&#x3002;</p>
<h2 id="&#x533A;&#x5757;&#x94FE;">&#x533A;&#x5757;&#x94FE;</h2>
<p><strong>&#x5730;&#x5740;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5C5E;&#x4E8E;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x7684;&#x516C;&#x94A5;&#x7684;&#x8868;&#x73B0;;&#x4F8B;&#x5982;&#xFF0C;&#x4E0E;&#x4E0A;&#x9762;&#x7ED9;&#x51FA;&#x7684;&#x79C1;&#x94A5;&#x7684;&#x76F8;&#x5173;&#x8054;&#x7684;&#x5730;&#x5740;&#x662F;cd2a3d9f938e13cd947ec05abc7fe734df8dd826&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x5730;&#x5740;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x7684;&#x6563;&#x5217;&#x503C;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6700;&#x597D;&#x5FFD;&#x7565;&#x8FD9;&#x79CD;&#x533A;&#x522B;&#x3002;</p>
<p><strong>&#x4EA4;&#x6613;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#xFF0C;&#x6388;&#x6743;&#x4E0E;&#x533A;&#x5757;&#x94FE;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x52A8;&#x4F5C;&#x3002;&#x5728;&#x4E00;&#x79CD;&#x8D27;&#x5E01;&#x91CC;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x4EA4;&#x6613;&#x7C7B;&#x578B;&#x662F;&#x53D1;&#x9001;&#x7684;&#x8D27;&#x5E01;&#x5355;&#x4F4D;&#x6216;&#x4EE3;&#x5E01;&#x7ED9;&#x522B;&#x4EBA;;&#x5728;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x57DF;&#x540D;&#x6CE8;&#x518C;&#xFF0C;&#x4F5C;&#x51FA;&#x548C;&#x5B8C;&#x6210;&#x62A5;&#x4EF7;&#x548C;&#x8BA2;&#x7ACB;&#x5408;&#x7EA6;&#x7684;&#x884C;&#x4E3A;&#x4E5F;&#x662F;&#x6709;&#x6548;&#x7684;&#x4EA4;&#x6613;&#x7C7B;&#x578B;&#x3002;</p>
<p><strong>&#x533A;&#x5757;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x524D;&#x5757;&#xFF08;&#x201C;&#x7236;&#x5757;&#x201D;&#xFF09;&#x7684;&#x6563;&#x5217;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x53EF;&#x9009;&#x7684;&#x5176;&#x5B83;&#x6570;&#x636E;&#x3002;&#x9664;&#x4E86;&#x521D;&#x59CB;&#x7684;&#x201C;&#x521B;&#x4E16;&#x533A;&#x5757;&#x201D;&#x4EE5;&#x5916;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x5305;&#x542B;&#x5B83;&#x7236;&#x5757;&#x7684;&#x6563;&#x5217;&#x503C;&#xFF0C;&#x533A;&#x5757;&#x7684;&#x5168;&#x90E8;&#x96C6;&#x5408;&#x88AB;&#x79F0;&#x4E3A;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5E76;&#x4E14;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x91CC;&#x7684;&#x5168;&#x90E8;&#x4EA4;&#x6613;&#x5386;&#x53F2;&#x3002;&#x6CE8;&#x610F;&#x6709;&#x4E9B;&#x57FA;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4F7F;&#x7528;&#x201C;&#x603B;&#x8D26;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x8BED;&#x6765;&#x4EE3;&#x66FF;&#x533A;&#x5757;&#x94FE;&#x3002;&#x8FD9;2&#x8005;&#x7684;&#x610F;&#x601D;&#x662F;&#x5927;&#x81F4;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x5728;&#x4F7F;&#x7528;&#x201C;&#x603B;&#x8D26;&#x201D;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x7684;&#x7CFB;&#x7EDF;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x7684;&#x76EE;&#x524D;&#x72B6;&#x6001;&#xFF08;&#x6BD4;&#x5982;&#x8D27;&#x5E01;&#x4F59;&#x989D;&#xFF0C;&#x90E8;&#x5206;&#x5C65;&#x884C;&#x7684;&#x5408;&#x7EA6;&#xFF0C;&#x6CE8;&#x518C;&#xFF09;&#x7684;&#x5168;&#x90E8;&#x62F7;&#x8D1D;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x629B;&#x5F03;&#x8FC7;&#x65F6;&#x7684;&#x5386;&#x53F2;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x5E10;&#x6237;</strong>&#xFF1A;&#x5E10;&#x6237;&#x662F;&#x5728;&#x603B;&#x8D26;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x7531;&#x5B83;&#x7684;&#x5730;&#x5740;&#x6765;&#x7D22;&#x5F15;&#xFF0C;&#x603B;&#x8D26;&#x5305;&#x542B;&#x6709;&#x5173;&#x8BE5;&#x5E10;&#x6237;&#x7684;&#x72B6;&#x6001;&#x7684;&#x5B8C;&#x6574;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x8D27;&#x5E01;&#x7CFB;&#x7EDF;&#x91CC;&#xFF0C;&#x8FD9;&#x5305;&#x542B;&#x4E86;&#x8D27;&#x5E01;&#x4F59;&#x989D;&#xFF0C;&#x6216;&#x8BB8;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x7684;&#x4EA4;&#x6613;&#x8BA2;&#x5355;;&#x5728;&#x5176;&#x5B83;&#x60C5;&#x51B5;&#x4E0B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5173;&#x7CFB;&#x53EF;&#x4EE5;&#x88AB;&#x5B58;&#x50A8;&#x5230;&#x8D26;&#x6237;&#x5185;&#x3002;</p>
<p><strong>&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;</strong>&#xFF1A;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4EE5;&#x592A;&#x574A;&#x548C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x52A0;&#x5BC6;&#x603B;&#x8D26;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x6027;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x5728;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6563;&#x5217;&#x503C;&#x5FC5;&#x987B;&#x6BD4;&#x67D0;&#x4E2A;&#x76EE;&#x6807;&#x503C;&#x5C0F;&#x3002;&#x8FD9;&#x4E2A;&#x5FC5;&#x8981;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5728;&#x5206;&#x6563;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x4EFB;&#x4F55;&#x4EBA;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x533A;&#x5757;&#xFF0C;&#x56E0;&#x6B64;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x7F51;&#x7EDC;&#x4E2D;&#x533A;&#x5757;&#x6CDB;&#x6EE5;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x8861;&#x91CF;&#x5728;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7248;&#x672C;&#x540E;&#x6709;&#x591A;&#x5C11;&#x5171;&#x8BC6;&#xFF0C;&#x4F7F;&#x5F97;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x975E;&#x5E38;&#x8270;&#x96BE;&#x3002;&#x7531;&#x4E8E;&#x6563;&#x5217;&#x503C;&#x662F;&#x4F2A;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x627E;&#x4E00;&#x4E2A;&#x6563;&#x5217;&#x503C;&#x6BD4;0000000100000000000000000000000000000000000000000000000000000000&#x8FD8;&#x5C0F;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x5E73;&#x5747;&#x9700;&#x8981;43&#x4EBF;&#x6B21;&#x5C1D;&#x8BD5;&#x3002;&#x5728;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x76EE;&#x6807;&#x503C;&#x8FDB;&#x884C;&#x81EA;&#x6211;&#x8C03;&#x6574;&#x4EE5;&#x4FBF;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5E73;&#x5747;&#x6BCF;N&#x5206;&#x949F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;N =10&#xFF0C;&#x4EE5;&#x592A;&#x574A;N&#xFF1D;1&#xFF09;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;</p>
<p><strong>&#x968F;&#x673A;&#x6570;</strong>&#xFF1A;&#x5728;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x503C;&#xFF0C;&#x4E3A;&#x4E86;&#x52AA;&#x529B;&#x6EE1;&#x8DB3;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x7684;&#x6761;&#x4EF6;&#x6765;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002;</p>
<p><strong>&#x6316;&#x77FF;</strong>&#xFF1A;&#x6316;&#x77FF;&#x662F;&#x53CD;&#x590D;&#x603B;&#x8BA1;&#x4EA4;&#x6613;&#xFF0C;&#x6784;&#x5EFA;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x4E0D;&#x540C;&#x7684;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x53EF;&#x4EE5;&#x7B26;&#x5408;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x7684;&#x6761;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x8D70;&#x8FD0;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x88AB;&#x6388;&#x4E88;&#x7684;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x5E01;&#xFF08;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x5168;&#x90E8;&#x8D39;&#x7528;&#xFF09;&#x4F5C;&#x4E3A;&#x5956;&#x52B1;&#x3002;&#x800C;&#x4E14;&#x6240;&#x6709;&#x7684;&#x77FF;&#x5DE5;&#x5F00;&#x59CB;&#x5C1D;&#x8BD5;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x5305;&#x542B;&#x4F5C;&#x4E3A;&#x7236;&#x5757;&#x7684;&#x6700;&#x65B0;&#x7684;&#x533A;&#x5757;&#x7684;&#x6563;&#x5217;&#x3002;</p>
<p><strong>&#x9648;&#x8150;&#x533A;&#x5757;</strong>&#xFF1A;&#x5BF9;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x7236;&#x5757;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x88AB;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x53C8;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x533A;&#x5757;;&#x9648;&#x65E7;&#x533A;&#x5757;&#x901A;&#x5E38;&#x88AB;&#x4E22;&#x5F03;&#xFF0C;&#x662F;&#x7CBE;&#x529B;&#x7684;&#x6D6A;&#x8D39;&#x3002;</p>
<p><strong>&#x5206;&#x53C9;</strong>&#xFF1A;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x7236;&#x5757;&#x7684;2&#x4E2A;&#x533A;&#x5757;&#x88AB;&#x540C;&#x65F6;&#x751F;&#x6210;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x67D0;&#x4E9B;&#x90E8;&#x5206;&#x7684;&#x77FF;&#x5DE5;&#x770B;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x77FF;&#x5DE5;&#x5219;&#x770B;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;2&#x79CD;&#x533A;&#x5757;&#x94FE;&#x540C;&#x65F6;&#x589E;&#x957F;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x968F;&#x7740;&#x5728;&#x4E00;&#x4E2A;&#x94FE;&#x4E0A;&#x7684;&#x77FF;&#x5DE5;&#x5F97;&#x5230;&#x5E78;&#x8FD0;&#x5E76;&#x4E14;&#x90A3;&#x6761;&#x94FE;&#x589E;&#x957F;&#x7684;&#x8BDD;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x77FF;&#x5DE5;&#x90FD;&#x4F1A;&#x8F6C;&#x5230;&#x90A3;&#x6761;&#x94FE;&#x4E0A;&#xFF0C;&#x6570;&#x5B66;&#x4E0A;&#x5206;&#x51E0;&#x4E4E;&#x4F1A;&#x5728;4&#x4E2A;&#x533A;&#x5757;&#x5185;&#x5B8C;&#x7ED3;&#x81EA;&#x5DF1;&#x3002;</p>
<p><strong>&#x53CC;&#x91CD;&#x82B1;&#x8D39;</strong>&#xFF1A;&#x662F;&#x4E00;&#x4E2A;&#x6545;&#x610F;&#x7684;&#x5206;&#x53C9;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x6709;&#x7740;&#x5927;&#x91CF;&#x6316;&#x77FF;&#x80FD;&#x529B;&#x7684;&#x7528;&#x6237;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x6765;&#x8D2D;&#x4E70;&#x4EA7;&#x54C1;&#xFF0C;&#x5728;&#x6536;&#x5230;&#x4EA7;&#x54C1;&#x540E;&#x53C8;&#x505A;&#x51FA;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x628A;&#x76F8;&#x540C;&#x91CF;&#x7684;&#x5E01;&#x53D1;&#x7ED9;&#x81EA;&#x5DF1;&#x3002;&#x653B;&#x51FB;&#x8005;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x548C;&#x5305;&#x542B;&#x539F;&#x59CB;&#x4EA4;&#x6613;&#x7684;&#x533A;&#x5757;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x5305;&#x542B;&#x5E76;&#x975E;&#x539F;&#x59CB;&#x4EA4;&#x6613;&#x800C;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x4E14;&#x5F00;&#x59CB;&#x5728;&#x8FD9;&#x4E2A;&#x5206;&#x53C9;&#x4E0A;&#x5F00;&#x59CB;&#x6316;&#x77FF;&#x3002;&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x6709;&#x8D85;&#x8FC7;50&#xFF05;&#x7684;&#x6316;&#x77FF;&#x80FD;&#x529B;&#x7684;&#x8BDD;&#xFF0C;&#x53CC;&#x91CD;&#x82B1;&#x8D39;&#x6700;&#x7EC8;&#x53EF;&#x4EE5;&#x5728;&#x4FDD;&#x8BC1;&#x5728;&#x4EFB;&#x4F55;&#x533A;&#x5757;&#x6DF1;&#x5EA6;&#x4E0A;&#x6210;&#x529F;&#x3002;&#x4F4E;&#x4E8E;50&#xFF05;&#x7684;&#x8BDD;&#xFF0C;&#x6709;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x6027;&#x6210;&#x529F;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x7ECF;&#x5E38;&#x5728;&#x6DF1;&#x5EA6;2-5&#x4E0A;&#x6709;&#x552F;&#x4E00;&#x663E;&#x8457;&#x7684;&#x53EF;&#x80FD;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x5927;&#x591A;&#x6570;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4EA4;&#x6613;&#x6240;&#xFF0C;&#x535A;&#x5F69;&#x7AD9;&#x70B9;&#x8FD8;&#x6709;&#x91D1;&#x878D;&#x670D;&#x52A1;&#x5728;&#x63A5;&#x53D7;&#x652F;&#x4ED8;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x7B49;&#x5F85;6&#x4E2A;&#x533A;&#x5757;&#x88AB;&#x751F;&#x4EA7;&#x51FA;&#x6765;&#xFF08;&#x4E5F;&#x53EB;&#x201C;6&#x6B21;&#x786E;&#x8BA4;&#x201D;&#xFF09;&#x3002;</p>
<p><strong>SPV&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x6216;&#x8F7B;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;</strong>&#xFF1A;&#x4E00;&#x4E2A;&#x53EA;&#x4E0B;&#x8F7D;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4F7F;&#x62E5;&#x6709;&#x50CF;&#x667A;&#x80FD;&#x624B;&#x673A;&#x548C;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x4E4B;&#x7C7B;&#x7684;&#x4F4E;&#x529F;&#x7387;&#x6216;&#x4F4E;&#x5B58;&#x50A8;&#x786C;&#x4EF6;&#x7684;&#x7528;&#x6237;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#x7684;&#x5B89;&#x5168;&#x4FDD;&#x8BC1;&#xFF0C;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x6709;&#x65F6;&#x9009;&#x62E9;&#x6027;&#x7684;&#x4E0B;&#x8F7D;&#x7684;&#x5C0F;&#x90E8;&#x5206;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x5728;&#x533A;&#x5757;&#x94FE;&#x9A8C;&#x8BC1;&#x548C;&#x7EF4;&#x62A4;&#x65F6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5146;&#x5B57;&#x8282;&#x7684;&#x5E26;&#x5BBD;&#x6216;&#x8005;&#x5343;&#x5146;&#x5B57;&#x8282;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;">&#x53C2;&#x8003;</h2>
<p>&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#xFF1A;<a href="http://en.wikipedia.org/wiki/Public-key_cryptography" target="_blank">http://en.wikipedia.org/wiki/Public-key_cryptography</a></p>

                            </div>
                            
                        
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                    </div>
                </div>
            </div>
        </div>
    </div>

    <footer class="gb-page-footer">
        <div class="container">
            <ul class="menu">
                <li class="pull-right">
                    <span class="service-info">Copyright GitBook 2016</span>
                </li>
                <li>
                    <a href="#">Return to the top</a>
                </li>
                <li>
                    <a href="#">Updated Jun 24th 16</a>
                </li>
            </ul>
        </div>
    </footer>
</div>

<script src="../gitbook/gitbook.js"></script>

    
    <script src="../gitbook/gitbook-plugin-baidu/plugin.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
    

<script>
(function() {
    gitbook.page.hasChanged({"page":{"title":"加密货币相关名词汇总","level":"1.7.1","depth":2,"next":{"title":"关于亿书","level":"1.7.2","depth":2,"path":"5-附录/2-关于亿书.md","ref":"5-附录/2-关于亿书.md","articles":[]},"previous":{"title":"附录","level":"1.7","depth":1,"path":"5-附录/readme.md","ref":"5-附录/readme.md","articles":[{"title":"加密货币相关名词汇总","level":"1.7.1","depth":2,"path":"5-附录/1-加密货币相关名词汇总.md","ref":"5-附录/1-加密货币相关名词汇总.md","articles":[]},{"title":"关于亿书","level":"1.7.2","depth":2,"path":"5-附录/2-关于亿书.md","ref":"5-附录/2-关于亿书.md","articles":[]},{"title":"关于区款链俱乐部","level":"1.7.3","depth":2,"path":"5-附录/3-关于区款链俱乐部.md","ref":"5-附录/3-关于区款链俱乐部.md","articles":[]},{"title":"关于作者","level":"1.7.4","depth":2,"path":"5-附录/4-关于作者.md","ref":"5-附录/4-关于作者.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["baidu","theme-official","-livereload"],"license":"MIT","ignores":["backup","_book","styles","assets","node_modules","sources","doc"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"baidu":{"token":"a489cddfaf5ed40abc3a60e2783e8019"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-official":{},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}}},"theme":"default","repository":{"type":"git","url":"https://github.com/imfly/bitcoin-on-nodejs.git"},"keywords":["bitcoin","nodejs"],"author":"Imfly","homepage":"http://imfly.github.io/bitcoin-on-nodejs","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bookname":"Nodejs开发加密货币","sortedBy":"-","variables":{},"language":"zh","gitbook":"*","description":"第一本详细讲解Nodejs在加密货币领域应用的免费电子书籍","bugs":{"url":"https://github.com/imfly/bitcoin-on-nodejs/issues"}},"file":{"path":"5-附录/1-加密货币相关名词汇总.md","mtime":"2016-06-24T11:40:33.244Z","type":"markdown"},"gitbook":{"version":"3.1.1","time":"2016-06-26T06:48:21.072Z"},"basePath":"..","book":{"language":""}});
})();
</script>

    </body>
</html>

