
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <title>记录应该记住的内容 · GitBook</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.1.1">
        <meta name="author" content="Imfly">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="shortcut icon" href="../gitbook/images/logo/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    

    
    
    <link rel="prev" href="readme.html" />
    

    </head>
    <body>
        
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


            <a href="/" class="logo">
                <img src="../gitbook/images/logo/128.png">
                <h1></h1>
            </a>

            

            
                
                
                <a href="readme.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-left"></i>
                </a>
                
            
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default">
        

        <div class="list-group">
            
    
        
        <a href="../" class="list-group-item ">
        
            
            Introduction
        
        </a>
        

        
    
        
        <span class="list-group-item">
        
            
            开篇的话
        
        </span>
        

        
    
        
        <a href="../1-了解加密货币/readme.html" class="list-group-item ">
        
            
            了解加密货币
        
        </a>
        

        
    
        
        <a href="../2-Node.js入门指南/readme.html" class="list-group-item ">
        
            
            Node.js入门指南
        
        </a>
        

        
    
        
        <a href="../3-源码解读/readme.html" class="list-group-item ">
        
            
            源码解读
        
        </a>
        

        
    
        
        <a href="../4-开发实践/readme.html" class="list-group-item ">
        
            
            开发实践
        
        </a>
        

        
    
        
        <span class="list-group-item">
        
            
            附录
        
        </span>
        

        
    
        
        <a href="readme.html" class="list-group-item ">
        
            
            后记
        
        </a>
        

        
        
    
        
        <a href="1-记录应该记住的内容.html" class="list-group-item active">
        
            
            记录应该记住的内容
        
        </a>
        

        
    

        
    

        </div>
    </div>
    


                    </div>
                    <div class="col-md-9">
                        
<div id="book-search-results">
    <div class="search-noresults">
    
                            
                            <div class="gb-markdown book-page-inner">
                                <h1 id="&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x7684;&#x8BDD;">&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x7684;&#x8BDD;</h1>
<p>&#x8BF7;&#x60A8;&#x7262;&#x8BB0;&#xFF1A;</p>
<p><strong>&#x6295;&#x8D44;&#x6709;&#x98CE;&#x9669;&#xFF0C;&#x5165;&#x5E02;&#x987B;&#x8C28;&#x614E;&#xFF01;</strong></p>
<p><strong>&#x6211;&#x4EEC;&#x5206;&#x4EAB;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EC5;&#x4EC5;&#x63D0;&#x4F9B;&#x4E86;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#xFF0C;&#x5173;&#x6CE8;&#x70B9;&#x5728;&#x6280;&#x672F;&#x672C;&#x8EAB;&#xFF0C;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x8BE5;&#x4EA7;&#x54C1;&#x4E00;&#x5B9A;&#x4F1A;&#x6210;&#x529F;&#xFF08;&#x53D6;&#x51B3;&#x4E8E;&#x5F88;&#x591A;&#x56E0;&#x7D20;&#xFF09;&#xFF0C;&#x4E0D;&#x80FD;&#x4F5C;&#x4E3A;&#x60A8;&#x662F;&#x5426;&#x6295;&#x8D44;&#x7684;&#x4F9D;&#x636E;&#x3002;</strong></p>
<p>&#x5199;&#x4E0B;&#x8FD9;&#x4E9B;&#x6587;&#x5B57;&#x7684;&#x65F6;&#x5019;&#xFF0C;Crypti&#x6838;&#x5FC3;&#x56E2;&#x961F;&#x5DF2;&#x7ECF;&#x5206;&#x88C2;&#x5B8C;&#x6210;&#xFF0C;&#x6709;&#x4E24;&#x540D;Crypti&#x56E2;&#x961F;&#x6210;&#x5458;&#x72EC;&#x7ACB;&#x51FA;&#x6765;&#xFF0C;&#x5728;&#x539F;&#x6765;&#x4EE3;&#x7801;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x3002;&#x6709;&#x70B9;&#x50CF;Bitcoin&#x7684;Core&#x548C;Classic&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x5728;&#x51B3;&#x5B9A;&#x5F00;&#x542F;&#x8FD9;&#x4E2A;&#x4E13;&#x680F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5BF9;Crypti&#x6709;&#x4E00;&#x79CD;&#x4E0D;&#x8E0F;&#x5B9E;&#x7684;&#x9884;&#x611F;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x5F53;&#x521D;Crypti&#x4EC5;&#x4EC5;&#x5F00;&#x6E90;&#x4E86;0.3.x&#x7248;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x6587;&#x4EF6;&#xFF0C;&#x5904;&#x4E8E;&#x534A;&#x5F00;&#x6E90;&#x72B6;&#x6001;&#x3002;&#x51ED;&#x591A;&#x5E74;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x5F00;&#x6E90;&#x534A;&#x63A8;&#x534A;&#x5C31;&#x7684;&#x72B6;&#x6001;&#x7EDD;&#x5BF9;&#x662F;&#x4E00;&#x79CD;&#x9519;&#x8BEF;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x624D;&#x6709;&#x4E86;&#x524D;&#x9762;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x5165;&#x95E8;&#x6587;&#x7AE0;&#xFF0C;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x5728;&#x7B49;&#x5F85;&#x548C;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x5728;&#x5927;&#x5BB6;&#x4E00;&#x518D;&#x8FFD;&#x95EE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Crypti&#x6700;&#x521D;&#x5E76;&#x6CA1;&#x6709;&#x7406;&#x4F1A;&#x793E;&#x533A;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x76F4;&#x5230;&#x6838;&#x5FC3;&#x56E2;&#x961F;&#x5206;&#x88C2;&#xFF0C;&#x5F00;&#x6E90;&#x624D;&#x5F7B;&#x5E95;&#x8FBE;&#x6210;&#x3002;&#x4F46;&#xFF0C;&#x5931;&#x53BB;&#x4E86;&#x793E;&#x533A;&#x4FE1;&#x4EFB;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x5B83;&#x7684;&#x672A;&#x6765;&#x8C01;&#x53C8;&#x80FD;&#x9884;&#x6599;&#xFF1F;&#x8FD9;&#x6216;&#x8BB8;&#x4E5F;&#x662F;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x7684;&#x98CE;&#x9669;&#x4E4B;&#x4E00;&#x5427;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD8;&#x597D;&#xFF0C;<strong>&#x6709;2&#x70B9;&#x5E78;&#x8FD0;</strong>&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x662F;&#x907F;&#x514D;&#x4E86;&#x88AB;&#x803B;&#x7B11;&#x7684;&#x98CE;&#x9669;&#x3002;&#x5728;&#x771F;&#x6B63;&#x5206;&#x4EAB;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x51FA;&#x73B0;&#x4E86;&#x5206;&#x88C2;&#xFF0C;&#x7ED9;&#x4E86;&#x6211;&#x4EEC;&#x8B66;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x8FC7;&#x7A0B;&#x4E2D;&#x51FA;&#x73B0;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x4E9B;&#x8BDD;&#x6CA1;&#x6709;&#x63D0;&#x524D;&#x8BF4;&#x51FA;&#x6765;&#xFF0C;&#x5FC5;&#x5B9A;&#x8BA9;&#x4E00;&#x4E9B;&#x8BFB;&#x8005;&#x6000;&#x7591;&#x4F5C;&#x8005;&#x7684;&#x773C;&#x5149;&#x800C;&#x5FFD;&#x89C6;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x90A3;&#x4E8E;&#x60A8;&#x4E8E;&#x6211;&#x90FD;&#x4E0D;&#x662F;&#x597D;&#x4E8B;&#xFF1B;</li>
<li>&#x4E8C;&#x662F;&#x83B7;&#x5F97;&#x4E86;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x6B21;&#x5206;&#x88C2;&#xFF0C;&#x4FC3;&#x6210;&#x4EE3;&#x7801;&#x5F7B;&#x5E95;&#x5F00;&#x6E90;&#xFF0C;&#x6211;&#x4EEC;&#x65B9;&#x624D;&#x6709;&#x673A;&#x4F1A;&#x5B66;&#x4E60;&#x4F7F;&#x7528;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x5BF9;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x771F;&#x6B63;&#x7684;&#x597D;&#x4E8B;&#x3002;</li>
</ul>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E00;&#x5B9A;&#x8981;&#x5206;&#x4EAB;&#x4E00;&#x4E2A;&#x770B;&#x4E0D;&#x5230;&#x672A;&#x6765;&#x7684;&#x4EA7;&#x54C1;&#xFF1F;&#x539F;&#x56E0;&#x6709;&#x4E8C;&#xFF1A;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x9664;&#x4E86;Bitcoin&#xFF08;&#x4EE5;&#x53CA;fork&#x5B83;&#x7684;&#x5176;&#x4ED6;&#x7ADE;&#x4E89;&#x5E01;&#xFF09;&#xFF0C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x7B97;&#x5F97;&#x4E0A;&#x6210;&#x529F;&#x7684;&#x4E5F;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x3002;Node.js&#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x4EA7;&#x54C1;&#x66F4;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5206;&#x4EAB;&#x54EA;&#x4E2A;&#x4EA7;&#x54C1;&#x533A;&#x522B;&#x4E0D;&#x5927;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;Crypti&#x7684;&#x7406;&#x60F3;&#x76EE;&#x6807;&#x548C;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x597D;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x8DEF;&#x503C;&#x5F97;&#x5B66;&#x4E60;&#xFF0C;&#x770B;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x5206;&#x4EAB;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x3002;</p>
<p><strong>2016.3.3&#x65E5;&#x8865;&#x5145;</strong>&#xFF1A;&#x76EE;&#x524D;&#x6765;&#x770B;&#xFF0C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x6587;&#x5B57;&#xFF0C;&#x622A;&#x6B62;&#x76EE;&#x524D;&#xFF0C;Crypti&#x6CA1;&#x6709;&#x518D;&#x66F4;&#x65B0;&#x8FC7;&#xFF0C;&#x5931;&#x8D25;&#x5DF2;&#x6210;&#x5B9A;&#x5C40;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x884D;&#x751F;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x662F;&#x5426;&#x4F1A;&#x8DD1;&#x8DEF;&#xFF0C;&#x662F;&#x5426;&#x4F1A;&#x6210;&#x529F;&#xFF1F;&#x65E0;&#x4ECE;&#x8003;&#x91CF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x672C;&#x4EBA;&#x53EA;&#x597D;&#x6B63;&#x5F0F;&#x5F00;&#x542F;Ebookcoin&#x9879;&#x76EE;&#xFF0C;&#x672C;&#x9879;&#x76EE;&#x7B79;&#x5212;&#x5DF2;&#x4E45;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x6211;2016&#x5E74;&#x7B2C;&#x4E8C;&#x9879;&#x5FC3;&#x613F;&#x5355;&#xFF0C;&#x4E3B;&#x5BFC;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x4E0D;&#x4EC5;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x8981;&#x5206;&#x4EAB;&#x5176;&#x5B8C;&#x6574;&#x5B9E;&#x73B0;&#xFF0C;&#x65E0;&#x7528;&#x5927;&#x6210;&#xFF0C;&#x4E5F;&#x7B97;&#x7ED9;&#x793E;&#x533A;&#x8D21;&#x732E;&#x4E86;&#x4E00;&#x4EFD;&#x529B;&#x91CF;&#x3002;&#x540E;&#x7EED;&#xFF0C;&#x4F1A;&#x516C;&#x5E03;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x656C;&#x8BF7;&#x5173;&#x6CE8;&#x3002;</p>
<p><strong>2016.5.16&#x8865;&#x5145;</strong>&#xFF1A;&#x7FFB;&#x770B;&#x8FC7;&#x53BB;&#x7684;&#x6587;&#x5B57;&#xFF0C;&#x56DE;&#x987E;&#x5F53;&#x521D;&#x7684;&#x5FC3;&#x60C5;&#x3002;&#x4ECE;&#x5E74;&#x521D;&#x5F00;&#x542F;&#x5199;&#x4F5C;&#x8FD9;&#x4E9B;&#x6587;&#x5B57;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x7728;&#x773C;&#x5DF2;&#x7ECF;4&#x4E2A;&#x591A;&#x6708;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x7D27;&#x5F20;&#x3001;&#x5FD9;&#x788C;&#x81EA;&#x4E0D;&#x5FC5;&#x8BF4;&#xFF0C;&#x56DE;&#x987E;&#x5F53;&#x65F6;&#x7684;&#x7EA0;&#x7ED3;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x6E05;&#x6670;&#x5982;&#x5728;&#x6628;&#x5929;&#x3002;Crypti&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x5386;&#x53F2;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x6587;&#x5B57;&#x5206;&#x4EAB;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x518D;&#x6709;&#x4EBA;&#x4F1A;&#x60F3;&#x5230;&#x5B83;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x5BF9;&#x4EBA;&#x7C7B;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x5931;&#x8D25;&#x800C;&#x7EC8;&#x7ED3;&#x3002;&#x4EBF;&#x4E66;&#x7EE7;&#x627F;&#x4E86;&#x5B83;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x5C06;&#x4F1A;&#x5728;&#x66F4;&#x5E7F;&#x9614;&#x7684;&#x7A7A;&#x95F4;&#x91CC;&#xFF0C;&#x53D1;&#x626C;&#x5B83;&#x7684;&#x7CBE;&#x795E;&#x3002;&#x4EBF;&#x4E66;&#x4F1A;&#x91C7;&#x53D6;&#x66F4;&#x52A0;&#x5F00;&#x653E;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x62E5;&#x62B1;&#x8FD9;&#x4E2A;&#x53D8;&#x5316;&#x591A;&#x7AEF;&#x7684;&#x4E16;&#x754C;&#x3002;&#x5BF9;&#x4EBF;&#x4E66;&#x800C;&#x8A00;&#xFF0C;Crypti&#x4E0D;&#x4E9A;&#x4E8E;&#x4E2D;&#x672C;&#x806A;&#xFF0C;&#x518D;&#x6B21;&#x5411;&#x5B83;&#x81F4;&#x656C;&#xFF0C;&#xFF01;</p>

                            </div>
                            
                        
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                    </div>
                </div>
            </div>
        </div>
    </div>

    <footer class="gb-page-footer">
        <div class="container">
            <ul class="menu">
                <li class="pull-right">
                    <span class="service-info">Copyright GitBook 2016</span>
                </li>
                <li>
                    <a href="#">Return to the top</a>
                </li>
                <li>
                    <a href="#">Updated Jun 24th 16</a>
                </li>
            </ul>
        </div>
    </footer>
</div>

<script src="../gitbook/gitbook.js"></script>

    
    <script src="../gitbook/gitbook-plugin-baidu/plugin.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
    

<script>
(function() {
    gitbook.page.hasChanged({"page":{"title":"记录应该记住的内容","level":"1.8.1","depth":2,"previous":{"title":"后记","level":"1.8","depth":1,"path":"6-后记/readme.md","ref":"6-后记/readme.md","articles":[{"title":"记录应该记住的内容","level":"1.8.1","depth":2,"path":"6-后记/1-记录应该记住的内容.md","ref":"6-后记/1-记录应该记住的内容.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["baidu","theme-official","-livereload"],"license":"MIT","ignores":["backup","_book","styles","assets","node_modules","sources","doc"],"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"},"pluginsConfig":{"baidu":{"token":"a489cddfaf5ed40abc3a60e2783e8019"},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-official":{},"theme-default":{"showLevel":false,"styles":{"ebook":"styles/ebook.css","epub":"styles/epub.css","mobi":"styles/mobi.css","pdf":"styles/pdf.css","print":"styles/print.css","website":"styles/website.css"}}},"theme":"default","repository":{"type":"git","url":"https://github.com/imfly/bitcoin-on-nodejs.git"},"keywords":["bitcoin","nodejs"],"author":"Imfly","homepage":"http://imfly.github.io/bitcoin-on-nodejs","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"bookname":"Nodejs开发加密货币","sortedBy":"-","variables":{},"language":"zh","gitbook":"*","description":"第一本详细讲解Nodejs在加密货币领域应用的免费电子书籍","bugs":{"url":"https://github.com/imfly/bitcoin-on-nodejs/issues"}},"file":{"path":"6-后记/1-记录应该记住的内容.md","mtime":"2016-06-24T11:40:33.244Z","type":"markdown"},"gitbook":{"version":"3.1.1","time":"2016-06-24T16:10:10.318Z"},"basePath":"..","book":{"language":""}});
})();
</script>

    </body>
</html>

